{"weightsManifest": [{"weights": [{"dtype": "float32", "shape": [512], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_1/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_2/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch1/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch1/beta"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch1/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch1/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2a/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2a/beta"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2a/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2a/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2b/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2b/beta"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2b/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2b/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch2c/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch2c/beta"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch2c/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch2c/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2a/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2a/beta"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2a/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2a/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2b/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2b/beta"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2b/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2b/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn2b_branch2c/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn2b_branch2c/beta"}, {"dtype": "float32", "shape": [256], "name": "bn2b_branch2c/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn2b_branch2c/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2a/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2a/beta"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2a/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2a/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2b/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2b/beta"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2b/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2b/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn2c_branch2c/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn2c_branch2c/beta"}, {"dtype": "float32", "shape": [256], "name": "bn2c_branch2c/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn2c_branch2c/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch1/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch1/beta"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch1/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch1/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2a/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2a/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2a/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2a/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2b/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2b/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2b/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2b/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch2c/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch2c/beta"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch2c/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch2c/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2a/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2a/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2a/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2a/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2b/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2b/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2b/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2b/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn3b_branch2c/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn3b_branch2c/beta"}, {"dtype": "float32", "shape": [512], "name": "bn3b_branch2c/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn3b_branch2c/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2a/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2a/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2a/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2a/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2b/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2b/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2b/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2b/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn3c_branch2c/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn3c_branch2c/beta"}, {"dtype": "float32", "shape": [512], "name": "bn3c_branch2c/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn3c_branch2c/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2a/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2a/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2a/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2a/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2b/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2b/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2b/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2b/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn3d_branch2c/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn3d_branch2c/beta"}, {"dtype": "float32", "shape": [512], "name": "bn3d_branch2c/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn3d_branch2c/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch1/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch1/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch1/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch1/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2a/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2a/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2a/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2a/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2b/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2b/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2b/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2b/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch2c/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch2c/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch2c/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch2c/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2a/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2a/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2a/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2a/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2b/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2b/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2b/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2b/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4b_branch2c/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4b_branch2c/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4b_branch2c/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4b_branch2c/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2a/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2a/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2a/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2a/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2b/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2b/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2b/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2b/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4c_branch2c/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4c_branch2c/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4c_branch2c/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4c_branch2c/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2a/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2a/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2a/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2a/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2b/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2b/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2b/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2b/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4d_branch2c/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4d_branch2c/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4d_branch2c/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4d_branch2c/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2a/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2a/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2a/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2a/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2b/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2b/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2b/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2b/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4e_branch2c/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4e_branch2c/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4e_branch2c/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4e_branch2c/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2a/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2a/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2a/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2a/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2b/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2b/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2b/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2b/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4f_branch2c/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4f_branch2c/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4f_branch2c/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4f_branch2c/moving_variance"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch1/gamma"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch1/beta"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch1/moving_mean"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch1/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2a/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2a/beta"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2a/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2a/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2b/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2b/beta"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2b/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2b/moving_variance"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch2c/gamma"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch2c/beta"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch2c/moving_mean"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch2c/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2a/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2a/beta"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2a/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2a/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2b/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2b/beta"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2b/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2b/moving_variance"}, {"dtype": "float32", "shape": [2048], "name": "bn5b_branch2c/gamma"}, {"dtype": "float32", "shape": [2048], "name": "bn5b_branch2c/beta"}, {"dtype": "float32", "shape": [2048], "name": "bn5b_branch2c/moving_mean"}, {"dtype": "float32", "shape": [2048], "name": "bn5b_branch2c/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2a/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2a/beta"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2a/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2a/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2b/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2b/beta"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2b/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2b/moving_variance"}, {"dtype": "float32", "shape": [2048], "name": "bn5c_branch2c/gamma"}, {"dtype": "float32", "shape": [2048], "name": "bn5c_branch2c/beta"}, {"dtype": "float32", "shape": [2048], "name": "bn5c_branch2c/moving_mean"}, {"dtype": "float32", "shape": [2048], "name": "bn5c_branch2c/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn_conv1/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn_conv1/beta"}, {"dtype": "float32", "shape": [64], "name": "bn_conv1/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn_conv1/moving_variance"}, {"dtype": "float32", "shape": [7, 7, 3, 64], "name": "conv1/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv1/bias"}, {"dtype": "float32", "shape": [2048, 512], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [512, 128], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [128], "name": "dense_2/bias"}, {"dtype": "float32", "shape": [128, 2], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [2], "name": "dense_3/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "res2a_branch1/kernel"}, {"dtype": "float32", "shape": [256], "name": "res2a_branch1/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "name": "res2a_branch2a/kernel"}, {"dtype": "float32", "shape": [64], "name": "res2a_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "res2a_branch2b/kernel"}, {"dtype": "float32", "shape": [64], "name": "res2a_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "res2a_branch2c/kernel"}, {"dtype": "float32", "shape": [256], "name": "res2a_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "name": "res2b_branch2a/kernel"}, {"dtype": "float32", "shape": [64], "name": "res2b_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "res2b_branch2b/kernel"}, {"dtype": "float32", "shape": [64], "name": "res2b_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "res2b_branch2c/kernel"}, {"dtype": "float32", "shape": [256], "name": "res2b_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "name": "res2c_branch2a/kernel"}, {"dtype": "float32", "shape": [64], "name": "res2c_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "res2c_branch2b/kernel"}, {"dtype": "float32", "shape": [64], "name": "res2c_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "res2c_branch2c/kernel"}, {"dtype": "float32", "shape": [256], "name": "res2c_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 512], "name": "res3a_branch1/kernel"}, {"dtype": "float32", "shape": [512], "name": "res3a_branch1/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "res3a_branch2a/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3a_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3a_branch2b/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3a_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3a_branch2c/kernel"}, {"dtype": "float32", "shape": [512], "name": "res3a_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "res3b_branch2a/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3b_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3b_branch2b/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3b_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3b_branch2c/kernel"}, {"dtype": "float32", "shape": [512], "name": "res3b_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "res3c_branch2a/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3c_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3c_branch2b/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3c_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3c_branch2c/kernel"}, {"dtype": "float32", "shape": [512], "name": "res3c_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "res3d_branch2a/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3d_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3d_branch2b/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3d_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3d_branch2c/kernel"}, {"dtype": "float32", "shape": [512], "name": "res3d_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 1024], "name": "res4a_branch1/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4a_branch1/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 256], "name": "res4a_branch2a/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4a_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4a_branch2b/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4a_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4a_branch2c/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4a_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b_branch2a/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4b_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b_branch2b/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4b_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b_branch2c/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4b_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4c_branch2a/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4c_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4c_branch2b/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4c_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4c_branch2c/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4c_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4d_branch2a/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4d_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4d_branch2b/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4d_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4d_branch2c/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4d_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4e_branch2a/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4e_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4e_branch2b/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4e_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4e_branch2c/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4e_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4f_branch2a/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4f_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4f_branch2b/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4f_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4f_branch2c/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4f_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 2048], "name": "res5a_branch1/kernel"}, {"dtype": "float32", "shape": [2048], "name": "res5a_branch1/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 512], "name": "res5a_branch2a/kernel"}, {"dtype": "float32", "shape": [512], "name": "res5a_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "res5a_branch2b/kernel"}, {"dtype": "float32", "shape": [512], "name": "res5a_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 2048], "name": "res5a_branch2c/kernel"}, {"dtype": "float32", "shape": [2048], "name": "res5a_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 2048, 512], "name": "res5b_branch2a/kernel"}, {"dtype": "float32", "shape": [512], "name": "res5b_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "res5b_branch2b/kernel"}, {"dtype": "float32", "shape": [512], "name": "res5b_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 2048], "name": "res5b_branch2c/kernel"}, {"dtype": "float32", "shape": [2048], "name": "res5b_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 2048, 512], "name": "res5c_branch2a/kernel"}, {"dtype": "float32", "shape": [512], "name": "res5c_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "res5c_branch2b/kernel"}, {"dtype": "float32", "shape": [512], "name": "res5c_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 2048], "name": "res5c_branch2c/kernel"}, {"dtype": "float32", "shape": [2048], "name": "res5c_branch2c/bias"}], "paths": ["group1-shard1of24", "group1-shard2of24", "group1-shard3of24", "group1-shard4of24", "group1-shard5of24", "group1-shard6of24", "group1-shard7of24", "group1-shard8of24", "group1-shard9of24", "group1-shard10of24", "group1-shard11of24", "group1-shard12of24", "group1-shard13of24", "group1-shard14of24", "group1-shard15of24", "group1-shard16of24", "group1-shard17of24", "group1-shard18of24", "group1-shard19of24", "group1-shard20of24", "group1-shard21of24", "group1-shard22of24", "group1-shard23of24", "group1-shard24of24"]}], "modelTopology": {"backend": "tensorflow", "model_config": {"config": {"output_layers": [["dense_3", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"kernel_size": [7, 7], "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv1", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 64, "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn_conv1", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn_conv1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [3, 3], "strides": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "kernel_regularizer": null, "use_bias": true, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res2a_branch2a", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res2a_branch2a", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn2a_branch2a", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn2a_branch2a", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res2a_branch2b", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res2a_branch2b", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn2a_branch2b", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn2a_branch2b", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "kernel_regularizer": null, "use_bias": true, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res2a_branch2c", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 256, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res2a_branch2c", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "kernel_regularizer": null, "use_bias": true, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res2a_branch1", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 256, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res2a_branch1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn2a_branch2c", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn2a_branch2c", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn2a_branch1", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn2a_branch1", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_1"}, "class_name": "Add", "name": "add_1", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "kernel_regularizer": null, "use_bias": true, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res2b_branch2a", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res2b_branch2a", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn2b_branch2a", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn2b_branch2a", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res2b_branch2b", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res2b_branch2b", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn2b_branch2b", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn2b_branch2b", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "kernel_regularizer": null, "use_bias": true, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res2b_branch2c", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 256, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res2b_branch2c", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn2b_branch2c", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn2b_branch2c", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_2"}, "class_name": "Add", "name": "add_2", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "kernel_regularizer": null, "use_bias": true, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res2c_branch2a", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res2c_branch2a", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn2c_branch2a", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn2c_branch2a", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res2c_branch2b", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res2c_branch2b", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn2c_branch2b", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn2c_branch2b", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "kernel_regularizer": null, "use_bias": true, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res2c_branch2c", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 256, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res2c_branch2c", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn2c_branch2c", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn2c_branch2c", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_3"}, "class_name": "Add", "name": "add_3", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "kernel_regularizer": null, "use_bias": true, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res3a_branch2a", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 128, "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res3a_branch2a", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn3a_branch2a", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn3a_branch2a", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res3a_branch2b", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 128, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res3a_branch2b", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn3a_branch2b", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn3a_branch2b", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "kernel_regularizer": null, "use_bias": true, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res3a_branch2c", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 512, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res3a_branch2c", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "kernel_regularizer": null, "use_bias": true, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res3a_branch1", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 512, "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res3a_branch1", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn3a_branch2c", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn3a_branch2c", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn3a_branch1", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn3a_branch1", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_4"}, "class_name": "Add", "name": "add_4", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "kernel_regularizer": null, "use_bias": true, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res3b_branch2a", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 128, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res3b_branch2a", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "momentum": 0.99, "name": "bn3b_branch2a", "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "name": "bn3b_branch2a", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "res3b_branch2b", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 128, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "name": "res3b_branch2b", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": 3, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, 